artifacts/load-test/k6-smoke-2026-07-05T17-56-48-365Z.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /workspace/tests/load/k6-smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  00.8s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  01.8s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  02.8s/30s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  03.8s/30s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  04.8s/30s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  05.8s/30s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  06.8s/30s

running (0m08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  07.8s/30s

running (0m09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  08.8s/30s

running (0m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  09.8s/30s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  10.8s/30s

running (0m12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  11.8s/30s

running (0m13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  12.8s/30s

running (0m14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  13.8s/30s

running (0m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  14.8s/30s

running (0m16.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  15.8s/30s

running (0m17.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  16.8s/30s

running (0m18.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  17.8s/30s

running (0m19.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  18.8s/30s

running (0m20.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  19.8s/30s

running (0m21.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  20.8s/30s

running (0m22.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  21.8s/30s

running (0m23.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  22.8s/30s

running (0m24.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  23.8s/30s

running (0m25.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  24.8s/30s

running (0m26.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  25.8s/30s

running (0m27.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  26.8s/30s

running (0m28.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  27.8s/30s

running (0m29.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  28.8s/30s

running (0m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  29.8s/30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=9.2ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 900     29.462109/s
    checks_succeeded...: 100.00% 900 out of 900
    checks_failed......: 0.00%   0 out of 900

    ✓ health ok
    ✓ v1 requests reachable
    ✓ v1 applications reachable

    HTTP
    http_req_duration..............: avg=4.1ms min=559.74µs med=1.6ms max=155.41ms p(90)=4.81ms p(95)=9.2ms
      { expected_response:true }...: avg=4.1ms min=559.74µs med=1.6ms max=155.41ms p(90)=4.81ms p(95)=9.2ms
    http_req_failed................: 0.00%  0 out of 901
    http_reqs......................: 901    29.494845/s

    EXECUTION
    iteration_duration.............: avg=1.01s min=1s       med=1s    max=1.17s    p(90)=1.01s  p(95)=1.02s
    iterations.....................: 300    9.820703/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 756 kB 25 kB/s
    data_sent......................: 424 kB 14 kB/s



running (0m30.5s), 00/10 VUs, 300 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s